#!/usr/bin/env bash

#----------------------------------------------------------------------------------
#   Core
#----------------------------------------------------------------------------------

echo "-----------  Генерация сервера"

echo "-----------  Генерация клиента сервиса Logger"
protoc -I$GOPATH/src/telegram_boxes \
    services/logs/protobuf/logs.proto --go_out=plugins=grpc:./services/core/protobuf

#----------------------------------------------------------------------------------
#   Bot
#----------------------------------------------------------------------------------

#----------------------------------------------------------------------------------
#   Admin
#----------------------------------------------------------------------------------

echo "-----------  Генерация клиента сервиса Logger"
protoc -I$GOPATH/src/telegram_boxes \
    services/logs/protobuf/logs.proto --go_out=plugins=grpc:./services/admin/protobuf

#----------------------------------------------------------------------------------
#   Logger
#----------------------------------------------------------------------------------

echo "-----------  Генерация сервера"
protoc -I$GOPATH/src/telegram_boxes \
    services/logs/protobuf/logs.proto --go_out=plugins=grpc:.