#!/usr/bin/env bash

#----------------------------------------------------------------------------------
#   Admin
#----------------------------------------------------------------------------------

echo "Обновление сервиса Admin"
cd $GOPATH/src/telegram_boxes/services/admin/
go mod tidy

#----------------------------------------------------------------------------------
#   Core
#----------------------------------------------------------------------------------
echo "Обновление сервиса Core"
cd $GOPATH/src/telegram_boxes/services/core/
go mod tidy

#----------------------------------------------------------------------------------
#   Logs
#----------------------------------------------------------------------------------
echo "Обновление сервиса Logs"
cd $GOPATH/src/telegram_boxes/services/logs/
go mod tidy